apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi.c
static inline uint32_t rspi_getreg32(struct rx65n_rspidev_s *priv,
                                     uint8_t offset);
static inline uint16_t rspi_getreg16(struct rx65n_rspidev_s *priv,
                                     uint8_t offset);
static inline uint8_t rspi_getreg8(struct rx65n_rspidev_s *priv,
                                   uint8_t offset);
static inline void rspi_putreg32(struct rx65n_rspidev_s *priv,
                                 uint8_t offset, uint32_t value);
static inline void rspi_putreg16(struct rx65n_rspidev_s *priv,
                                 uint8_t offset, uint16_t value);
static inline void rspi_putreg8(struct rx65n_rspidev_s *priv,
                                uint8_t offset, uint8_t value);

/* SPI data transfer */

#if defined(CONFIG_RX65N_RSPI_SW_DT_MODE)
static void rspi_txnull(struct rx65n_rspidev_s *priv);
static void rspi_txuint32(struct rx65n_rspidev_s *priv);
static void rspi_txuint16(struct rx65n_rspidev_s *priv);
static void rspi_txuint8(struct rx65n_rspidev_s *priv);
static void rspi_rxnull(struct rx65n_rspidev_s *priv);
static void rspi_rxuint32(struct rx65n_rspidev_s *priv);
static void rspi_rxuint16(struct rx65n_rspidev_s *priv);
static void rspi_rxuint8(struct rx65n_rspidev_s *priv);
static void rspi_performtx(struct rx65n_rspidev_s *priv);
static inline void rspi_performrx(struct rx65n_rspidev_s *priv);
#endif
static int rspi_transfer(struct rx65n_rspidev_s *priv, const void *txbuffer,
                         void *rxbuffer, unsigned int nwords);

/* Interrupt handling */

#ifndef CONFIG_SPI_POLLWAIT
static inline struct rx65n_rspidev_s *rspi_mapirq(int irq);
static int rspi_idlinterrupt(int irq, void *context, void *arg);
static int rspi_erinterrupt(int irq, void *context, void *arg);
static int rspi_txinterrupt(int irq, void *context, void *arg);
static int rspi_rxinterrupt(int irq, void *context, void *arg);
#endif

/* SPI methods */

static int   rspi_lock(struct spi_dev_s *dev, bool lock);
static uint32_t rspi_setfrequency(struct spi_dev_s *dev,
                                  uint32_t frequency);
static void  rspi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode);
static void  rspi_setbits(struct spi_dev_s *dev, int nbits);
#ifdef CONFIG_SPI_HWFEATURES
static int  rspi_hwfeatures(struct spi_dev_s *dev,
                            spi_hwfeatures_t features);
#endif
static uint32_t rspi_send(struct spi_dev_s *dev, uint32_t wd);
static void rspi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                          void *rxbuffer, size_t nwords);
#ifdef CONFIG_SPI_TRIGGER
static int  rspi_trigger(struct spi_dev_s *dev);
#endif
#ifndef CONFIG_SPI_EXCHANGE
static void rspi_sndblock(struct spi_dev_s *dev, const void *txbuffer,
                          size_t nwords);
static void  rspi_recvblock(struct spi_dev_s *dev, void *rxbuffer,
                            size_t nwords);
#endif

/* Initialization */

static void  rspi_bus_initialize(struct rx65n_rspidev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_RX65N_RSPI0
#if defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
dtc_transfer_data_t g_tx0dt;
dtc_transfer_data_t g_rx0dt;
#endif
static const struct spi_ops_s g_rspi0ops =
{
  .lock = rspi_lock,
  .select = rx65n_rspi0select,
  .setfrequency = rspi_setfrequency,
  .setmode = rspi_setmode,
  .setbits = rspi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures = rspi_hwfeatures,
#endif
  .status = rx65n_rspi0status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata = rx65n_rspi0cmddata,
#endif
  .send = rspi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange = rspi_exchange,
#else
  .sndblock = rspi_sndblock,
  .recvblock = rspi_recvblock,
#endif

#ifdef CONFIG_SPI_CALLBACK
  .registercallback = rx65n_rspi0register,  /* Provided externally */
#else
  .registercallback = 0,
#endif
};

static struct rx65n_rspidev_s g_rspi0dev =
{
  .rspidev =
  {
    .ops = &g_rspi0ops,
  },
  .rspibase  = RX65N_RSPI0_BASE,
  .rspiclock = RX65N_PCLK_FREQUENCY,
#ifndef CONFIG_SPI_POLLWAIT
  .rspitxirq  = RX65N_SPTI0_IRQ,
  .rspirxirq  = RX65N_SPRI0_IRQ,
  .rspierirq  = RX65N_SPEI0_IRQ,
  .rspiidlirq  = RX65N_SPII0_IRQ,
  .rspigrpbase = RX65N_GRPAL0_ADDR,
  .rspierimask = RX65N_GRPAL0_SPEI0_MASK,
  .rspiidlimask = RX65N_GRPAL0_SPII0_MASK,
  .waitsem = SEM_INITIALIZER(0),
#endif
#if defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
  .p_txdt  = &g_tx0dt,
  .p_rxdt  = &g_rx0dt,
  .txsem = SEM_INITIALIZER(0),
  .rxsem = SEM_INITIALIZER(0),
  .txvec = RX65N_RSPI0_TXVECT,
  .rxvec = RX65N_RSPI0_RXVECT,
#endif
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_RX65N_RSPI1
#if defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
dtc_transfer_data_t g_tx1dt;
dtc_transfer_data_t g_rx1dt;
#endif
static const struct spi_ops_s g_rspi1ops =
{
  .lock = rspi_lock,
  .select = rx65n_rspi1select,
  .setfrequency = rspi_setfrequency,
  .setmode = rspi_setmode,
  .setbits = rspi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures = rspi_hwfeatures,
#endif
  .status = rx65n_rspi1status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata = rx65n_rspi1cmddata,
#endif
  .send = rspi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange = rspi_exchange,
#else
  .sndblock = rspi_sndblock,
  .recvblock = rspi_recvblock,
#endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger = rspi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback = rx65n_rspi1register,  /* Provided externally */
#else
  .registercallback = 0,
#endif
};

static struct rx65n_rspidev_s g_rspi1dev =
{
  .rspidev =
  {
    .ops = &g_rspi1ops,
  },
  .rspibase  = RX65N_RSPI1_BASE,
  .rspiclock = RX65N_PCLK_FREQUENCY,
#ifndef CONFIG_SPI_POLLWAIT
  .rspitxirq  = RX65N_SPTI1_IRQ,
  .rspirxirq  = RX65N_SPRI1_IRQ,
  .rspierirq  = RX65N_SPEI1_IRQ,
  .rspiidlirq  = RX65N_SPII1_IRQ,
  .rspigrpbase = RX65N_GRPAL0_ADDR,
  .rspierimask = RX65N_GRPAL0_SPEI1_MASK,
  .rspiidlimask = RX65N_GRPAL0_SPII1_MASK,
  .waitsem = SEM_INITIALIZER(0),
#endif
#if defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
  .p_txdt = &g_tx1dt,
  .p_rxdt = &g_rx1dt,
  .txsem = SEM_INITIALIZER(0),
  .rxsem = SEM_INITIALIZER(0),
  .txvec = RX65N_RSPI1_TXVECT,
  .rxvec = RX65N_RSPI1_RXVECT,
#endif
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#ifdef CONFIG_RX65N_RSPI2
#if defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
dtc_transfer_data_t g_tx2dt;
dtc_transfer_data_t g_rx2dt;
#endif
static const struct spi_ops_s g_rspi2ops =
{
  .lock = rspi_lock,
  .select = rx65n_rspi2select,
  .setfrequency = rspi_setfrequency,
  .setmode = rspi_setmode,
  .setbits = rspi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures = rspi_hwfeatures,
#endif
  .status = rx65n_rspi2status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata = rx65n_rspi2cmddata,
#endif
  .send = rspi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange = rspi_exchange,
#else
  .sndblock = rspi_sndblock,
  .recvblock = rspi_recvblock,
#endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger = rspi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback = rx65n_rspi2register,  /* Provided externally */
#else
  .registercallback = 0,
#endif
};

static struct rx65n_rspidev_s g_rspi2dev =
{
  .rspidev =
  {
    .ops = &g_rspi2ops,
  },
  .rspibase  = RX65N_RSPI2_BASE,
  .rspiclock = RX65N_PCLK_FREQUENCY,
#ifndef CONFIG_SPI_POLLWAIT
  .rspitxirq  = RX65N_SPTI2_IRQ,
  .rspirxirq  = RX65N_SPRI2_IRQ,
  .rspierirq  = RX65N_SPEI2_IRQ,
  .rspiidlirq  = RX65N_SPII2_IRQ,
  .rspigrpbase = RX65N_GRPAL0_ADDR,
  .rspierimask = RX65N_GRPAL0_SPEI2_MASK,
  .rspiidlimask = RX65N_GRPAL0_SPII2_MASK,
  .waitsem = SEM_INITIALIZER(0),
#endif
#if defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
  .p_txdt = &g_tx2dt,
  .p_rxdt = &g_rx2dt,
  .txsem = SEM_INITIALIZER(0),
  .rxsem = SEM_INITIALIZER(0),
  .txvec = RX65N_RSPI2_TXVECT,
  .rxvec = RX65N_RSPI2_RXVECT,
#endif
  .lock = NXMUTEX_INITIALIZER,
};
#endif

#if defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
dtc_static_transfer_data_cfg_t tx_cfg =
{
#if CONFIG_RX65N_RSPI_BUF_SIZE > 1
  .transfer_mode = DTC_TRANSFER_MODE_BLOCK,
#else
  .transfer_mode = DTC_TRANSFER_MODE_NORMAL,
#endif
  .data_size = DTC_DATA_SIZE_BYTE,
  .src_addr_mode = DTC_SRC_ADDR_INCR,
  .chain_transfer_enable = DTC_CHAIN_TRANSFER_DISABLE,
  .chain_transfer_mode = DTC_CHAIN_TRANSFER_CONTINUOUSLY,
  .response_interrupt = DTC_INTERRUPT_AFTER_ALL_COMPLETE,
  .repeat_block_side = DTC_REPEAT_BLOCK_DESTINATION,
  .dest_addr_mode = DTC_DES_ADDR_FIXED,
  .source_addr = 0,    /* This will set dynamically */
  .dest_addr = 0,      /* Set data register address */
  .transfer_count = 0, /* This will set dynamically */
#if CONFIG_RX65N_RSPI_BUF_SIZE > 1
  .block_size = CONFIG_RX65N_RSPI_BUF_SIZE, /* Looks like tx fifo size */
#else
  .block_size = 0,
#endif
  .rsv = 0,
  .writeback_disable = DTC_WRITEBACK_ENABLE,
  .sequence_end = DTC_SEQUENCE_TRANSFER_CONTINUE,
  .refer_index_table_enable = DTC_REFER_INDEX_TABLE_DISABLE,
  .disp_add_enable = DTC_SRC_ADDR_DISP_ADD_DISABLE,
};

dtc_static_transfer_data_cfg_t rx_cfg =
{
#if CONFIG_RX65N_RSPI_BUF_SIZE > 1
  .transfer_mode = DTC_TRANSFER_MODE_BLOCK,
#else
  .transfer_mode = DTC_TRANSFER_MODE_NORMAL,
#endif
  .data_size       = DTC_DATA_SIZE_BYTE,
  .src_addr_mode = DTC_SRC_ADDR_FIXED,
  .chain_transfer_enable = DTC_CHAIN_TRANSFER_DISABLE,
  .chain_transfer_mode = DTC_CHAIN_TRANSFER_CONTINUOUSLY,
  .response_interrupt = DTC_INTERRUPT_AFTER_ALL_COMPLETE,
  .repeat_block_side = DTC_REPEAT_BLOCK_SOURCE,
  .dest_addr_mode = DTC_DES_ADDR_INCR,
  .source_addr = 0,            /* Set data register address */
  .dest_addr = 0,              /* This will set dynamically */
  .transfer_count = 0,         /* This will set dynamically */
#if CONFIG_RX65N_RSPI_BUF_SIZE > 1
  .block_size = CONFIG_RX65N_RSPI_BUF_SIZE, /* Looks like tx fifo size */
#else
  .block_size = 0,
#endif
  .rsv = 0,
  .writeback_disable = DTC_WRITEBACK_ENABLE,
  .sequence_end = DTC_SEQUENCE_TRANSFER_CONTINUE,
  .refer_index_table_enable = DTC_REFER_INDEX_TABLE_DISABLE,
  .disp_add_enable = DTC_SRC_ADDR_DISP_ADD_DISABLE,
};
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name:  rx65n_rspi0/1/2 select and rx65n_rspi0/1/2 status
 *
 * Description:
 * The external functions, rx65n_rspi0/1/2 select, rx65n_rspi0/1/2 status,and
 * rx65n_rspi0/1/2 cmddata must be provided by board-specific logic. These
 * are implementations of the select, status, and cmddata methods of the SPI
 * interface defined by struct spi_ops_s (see include/nuttx/spi/spi.h). All
 * other methods (including rx65n_rspibus_initialize()) are provided by
 * common R656N logic.  To use thiscommon SPI logic on your board:
 *
 *   1. Provide logic in stm32_boardinitialize() to configure SPI chip select
 *      pins.
 *   2. Provide stm32_spi1/2/...select() and stm32_spi1/2/...status()
 *      functions in your board-specific logic.  These functions will
 *      perform chip selection and status operations using GPIOs in the
 *      way your board is configured.
 *   3. If CONFIG_SPI_CMDDATA is defined in your NuttX configuration file,
 *      then provide stm32_spi1/2/...cmddata() functions in your
 *      board-specific logic.These functions will perform cmd/data
 *      selection operations using GPIOs in the way your board is configured.
 *   4. Add a calls to stm32_spibus_initialize() in your low level
 *      application initialization logic
 *   5. The handle returned by stm32_spibus_initialize() may then be used to
 *      bind the SPI driver to higher level logic (e.g., calling
 *      mmcsd_spislotinitialize(), for example, will bind the SPI driver to
 *      the SPI MMC/SD driver).
 *
 ****************************************************************************/
#ifdef CONFIG_RX65N_RSPI0
void rx65n_rspi0select(struct spi_dev_s *dev, uint32_t devid,
                       bool selected)
{
  spiinfo("devid: %d CS: %s\n", (int)devid, selected ? "assert" :
                                                   "de-assert");
}

