apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi.c
static void rspi_rxuint32(struct rx65n_rspidev_s *priv)
{
  uint32_t *ptr = (uint32_t *)priv->rxbuffer;
  *ptr++ = (uint32_t)rspi_getreg32(priv, RX65N_RSPI_SPDR_OFFSET);
  priv->rxbuffer = (void *)ptr;
}

static void rspi_rxuint16(struct rx65n_rspidev_s *priv)
{
  uint16_t *ptr = (uint16_t *)priv->rxbuffer;
  *ptr++ = (uint16_t)rspi_getreg16(priv, RX65N_RSPI_SPDR_OFFSET);
  priv->rxbuffer = (void *)ptr;
}

static void rspi_rxuint8(struct rx65n_rspidev_s *priv)
{
  uint8_t *ptr = (uint8_t *)priv->rxbuffer;
  *ptr++ = (uint8_t)rspi_getreg8(priv, RX65N_RSPI_SPDR_OFFSET);
  priv->rxbuffer = (void *)ptr;
}
#endif

/****************************************************************************
 * Name: rspi_performtx
 *
 * Description:
 *   If the Tx FIFO is empty, then transfer as many words as we can to
 *   the FIFO.
 *
 * Input Parameters:
 *
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#if defined(CONFIG_RX65N_RSPI_SW_DT_MODE)
static void rspi_performtx(struct rx65n_rspidev_s *priv)
{
  uint8_t regval8;
  int ntxd = 0;  /* Number of words written to Tx FIFO */

  /* Check if the Tx FIFO is empty */

  if ((rspi_getreg8(priv, RX65N_RSPI_SPSR_OFFSET) & RSPI_SPSR_SPTEF) != 0)
    {
      /* Check if all of the Tx words have been sent */

      if (priv->ntxwords > 0)
        {
          /* No..
           * Transfer more words until either the TxFIFO is full or
           * until all of the user provided data has been sent.
           */

          for (; ntxd < priv->ntxwords && ntxd < priv->bufsize; ntxd++)
            {
              priv->txword(priv);
            }

          /* Update the count of words to be transferred */

          priv->ntxwords -= ntxd;

          /* Add dummy data in FIFO to make it full */

          if (ntxd < priv->bufsize)
            {
              while (ntxd != priv->bufsize)
                {
                  rspi_txnull(priv);
                  ntxd++;
                }
            }
        }
      else
        {
          /* Yes.. The transfer is complete,
           * disable Tx FIFO empty interrupt
           */

          regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
          regval8 &= ~RSPI_SPCR_SPTIE;
          rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);
        }
    }
}
#endif

/****************************************************************************
 * Name: rspi_performrx
 *
 * Description:
 *   Transfer as many bytes as possible from the Rx FIFO to the user Rx
 *   buffer (if one was provided).
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#if defined(CONFIG_RX65N_RSPI_SW_DT_MODE)
static inline void rspi_performrx(struct rx65n_rspidev_s *priv)
{
  /* Loop while data is available in the Rx FIFO (SPRXn) */

  while ((rspi_getreg8(priv, RX65N_RSPI_SPSR_OFFSET) & RSPI_SPSR_SPRF) != 0)
    {
      /* Have all of the requested words been transferred from the Rx FIFO? */

      if (priv->nrxwords < priv->nwords)
        {
          /* No.. Read more data from Rx FIFO */

          priv->rxword(priv);
          priv->nrxwords++;
        }
      else
        {
          rspi_rxnull(priv); /* Reading dummy data send */
        }
    }
}
#endif

/****************************************************************************
 * Name: rspi_startxfr
 *
 * Description:
 *   If data was added to the Tx FIFO, then start the exchange
 *
 * Input Parameters:
 *   priv  - Device-specific state data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void rspi_startxfr(struct rx65n_rspidev_s *priv)
{
  uint8_t regval8;

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 |= RSPI_SPCR_SPE;
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);
}

/****************************************************************************
 * Name: spi_dtcrxsetup
 *
 * Description:
 *   Setup to perform RX DTC
 *
 ****************************************************************************/

#ifdef CONFIG_RX65N_RSPI_DTC_DT_MODE
static dtc_err_t rspi_dtctxsetup(struct rx65n_rspidev_s *priv,
                                 const void *txbuffer,
                                 const void *txdummy, size_t nwords)
{
  dtc_err_t  ret = DTC_SUCCESS;
  dtc_dynamic_transfer_data_cfg_t dcfg;

  /* 8- or 16-bit mode? */

  if (priv->nbits >= 4 && priv->nbits <= 8)
    {
      if (txbuffer)
        {
          dcfg.data_size = DTC_DATA_SIZE_BYTE;
        }
      else
        {
          txbuffer    = txdummy;
          dcfg.data_size = DTC_DATA_SIZE_BYTE;
        }
    }
  else if (priv->nbits > 8 && priv->nbits <= 16)
    {
      if (txbuffer)
        {
          dcfg.data_size = DTC_DATA_SIZE_WORD;
        }
      else
        {
          txbuffer    = txdummy;
          dcfg.data_size = DTC_DATA_SIZE_WORD;
        }
    }
  else
    {
      spierr("ERROR: RSPI not supporting: %d bit word\n", priv->nbits);
    }

  dcfg.source_addr = (uint32_t)txbuffer;
  dcfg.dest_addr = priv->rspibase + RX65N_RSPI_SPDR_OFFSET;

  /* Configure block size if buf size is configured as more than 1 */

  if (CONFIG_RX65N_RSPI_BUF_SIZE - 1)
    {
      /* Configure DTC in Block transfer mode */

      dcfg.block_size = CONFIG_RX65N_RSPI_BUF_SIZE;
      dcfg.transfer_count = nwords / CONFIG_RX65N_RSPI_BUF_SIZE;
    }
  else
    {
      dcfg.transfer_count = nwords;
    }

  /* Configure the RX DTC */

  ret = rx65n_dtc_setup_dynamic_transferdata(priv->dtchandle, priv->txvec,
                                             (uint32_t)&dcfg, 0);
  if (ret < 0)
    {
      spierr("ERROR:[%d] Fail to configure DTC information for TX\n", ret);
      return ret;
    }

  return ret;
}

/****************************************************************************
 * Name: spi_dtcrxsetup
 *
 * Description:
 *   Setup to perform RX DTC
 *
 ****************************************************************************/

static dtc_err_t rspi_dtcrxsetup(struct rx65n_rspidev_s *priv,
                                 void *rxbuffer, void *rxdummy,
                                 size_t nwords)
{
  dtc_err_t  ret = DTC_SUCCESS;
  dtc_dynamic_transfer_data_cfg_t dcfg;

  /* 8- or 16-bit mode */

