apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi.c
  if (priv->nbits >= 4 && priv->nbits <= 8)
    {
      if (rxbuffer)
        {
          dcfg.data_size = DTC_DATA_SIZE_BYTE;
        }
      else
        {
          rxbuffer    = rxdummy;
          dcfg.data_size = DTC_DATA_SIZE_BYTE;
        }
    }
  else if (priv->nbits > 8 && priv->nbits <= 16)
    {
      if (rxbuffer)
        {
          dcfg.data_size = DTC_DATA_SIZE_WORD;
        }
      else
        {
          rxbuffer    = rxdummy;
          dcfg.data_size = DTC_DATA_SIZE_WORD;
        }
    }
  else
    {
      spierr("ERROR: RSPI not supporting: %d bit word\n", nbits);
    }

  dcfg.source_addr = priv->rspibase + RX65N_RSPI_SPDR_OFFSET;
  dcfg.dest_addr = (uint32_t)rxbuffer;

  /* Configure block size if buf size is configured as more than 1 */

  if (CONFIG_RX65N_RSPI_BUF_SIZE - 1)
    {
      /* Configure DTC in Block transfer mode */

      dcfg.block_size = CONFIG_RX65N_RSPI_BUF_SIZE;
      dcfg.transfer_count = nwords / CONFIG_RX65N_RSPI_BUF_SIZE;
    }
  else
    {
      dcfg.transfer_count = nwords;
    }

  /* Configure the RX DTC */

  ret = rx65n_dtc_setup_dynamic_transferdata(priv->dtchandle,
                                  priv->rxvec, (uint32_t)&dcfg, 0);
  if (ret < 0)
    {
      spierr("ERROR:[%d] Fail to configure DTC information for RX\n", ret);
      return ret;
    }

  return ret;
}

#endif

/****************************************************************************
 * Name: rspi_transfer
 *
 * Description:
 *   Exchange a block data with the SPI device
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   txbuffer - The buffer of data to send to the device (may be NULL).
 *   rxbuffer - The buffer to receive data from the device (may be NULL).
 *   nwords   - The total number of words to be exchanged.  If the interface
 *              uses <= 8 bits per word, then this is the number of
 *              uint8_t's; if the interface uses >8 bits per word, then this
 *              is the number of uint16_t's
 *
 * Returned Value:
 *   0: success, <0:Negated error number on failure
 *
 ****************************************************************************/
#ifdef CONFIG_RX65N_RSPI_SW_DT_MODE
static int rspi_transfer(struct rx65n_rspidev_s *priv, const void *txbuffer,
                         void *rxbuffer, unsigned int nwords)
{
  uint8_t regval8;
#ifndef CONFIG_SPI_POLLWAIT
  irqstate_t flags;
#endif

  /* Set up to perform the transfer */

  priv->txbuffer = (uint8_t *)txbuffer; /* Source buffer */
  priv->rxbuffer = (uint8_t *)rxbuffer; /* Destination buffer */
  priv->ntxwords = nwords;              /* Number of words left to send */
  priv->nrxwords = 0;                   /* Number of words received */
  priv->nwords = nwords;                /* Total number of exchanges */

  /* Set up the low-level data transfer function pointers */

  if (priv->nbits > 16)
    {
      priv->txword = rspi_txuint32;
      priv->rxword = rspi_rxuint32;
    }

  if (priv->nbits > 8)
    {
      priv->txword = rspi_txuint16;
      priv->rxword = rspi_rxuint16;
    }
  else
    {
      priv->txword = rspi_txuint8;
      priv->rxword = rspi_rxuint8;
    }

  if (!txbuffer)
    {
      priv->txword = rspi_txnull;
    }

  if (!rxbuffer)
    {
      priv->rxword = rspi_rxnull;
    }

  /* Copied data to start the sequence (saves one interrupt) */

#ifndef CONFIG_SPI_POLLWAIT
  flags = enter_critical_section();

  /* Enable interrupt */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 |= (RSPI_SPCR_SPEIE | RSPI_SPCR_SPTIE | RSPI_SPCR_SPRIE);
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* Start transmission */

  rspi_performtx(priv);
  rspi_startxfr(priv);

  /* Enable Idle interrupt */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR2_OFFSET);
  regval8 |= (RSPI_SPCR2_SPIIE); /* RSPI Idle Interrupt Enable */
  rspi_putreg8(priv, RX65N_RSPI_SPCR2_OFFSET, regval8);

  leave_critical_section(flags);

  /* Wait for the transfer to complete.  Since there is no handshake
   * with SPI, the following should complete even if there are problems
   * with the transfer, so it should be safe with no timeout.
   */

  /* Wait to be signaled from the interrupt handler */

  return nxsem_wait_uninterruptible(&priv->waitsem);

#else
  /* Perform the transfer using polling logic.  This will totally
   * dominate the CPU until the transfer is complete.  Only recommended
   * if (1) your SPI is very fast, and (2) if you only use very short
   * transfers.
   */

  do
    {
      /* Handle outgoing Tx FIFO transfers */

      rspi_performtx(priv);

      /* Handle incoming Rx FIFO transfers */

      rspi_performrx(priv);

      /* Resume the transfer */

      rspi_startxfr(priv);

      /* If there are other threads at this same priority level,
       * the following may help:
       */

      sched_yield();
    }
  while (priv->nrxwords < priv->nwords);

  return OK;
#endif
}
#elif defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
static int rspi_transfer(struct rx65n_rspidev_s *priv, const void *txbuffer,
                         void *rxbuffer, unsigned int nwords)
{
  uint8_t regval8;
  static uint16_t rxdummy = 0xffff;
  static const uint16_t txdummy = 0xffff;
  irqstate_t flags;
  int ret;

  /* Disable RSPI */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 &= (~RSPI_SPCR_SPE);
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* Setup DTC */

  ret = rspi_dtctxsetup(priv, txbuffer, &txdummy, nwords);
  if (ret > 1)
    {
      spierr("ERROR:Fail to setup DTC for TX transfer\n");
      return -EINVAL;
    }

  ret = rspi_dtcrxsetup(priv, rxbuffer, &rxdummy, nwords);
  if (ret > 1)
    {
      spierr("ERROR:[%d] Fail to setup DTC for RX transfer\n");
      return -EINVAL;
    }

  flags = enter_critical_section();

  /* Enable RSPI source for DTC trigger */

  rx65n_dtc_srcactivation(priv->dtchandle, priv->txvec);
  rx65n_dtc_srcactivation(priv->dtchandle, priv->rxvec);

  /* Enable TX, RX and Error interrupt */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 |= (RSPI_SPCR_SPEIE | RSPI_SPCR_SPRIE | RSPI_SPCR_SPTIE);
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

