apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi.c
  rspi_performrx(priv);
#else

  /* Disable ransmit/receive interrupt */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 &= ~(RSPI_SPCR_SPRIE | RSPI_SPCR_SPTIE);
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* Yes, wake up the waiting thread */

  nxsem_post(&priv->waitsem);

#endif

  return OK;
}
#endif

/****************************************************************************
 * Name: rspi_txinterrupt
 *
 * Description:
 *   Transmit buffer empty interrupt handler to process a block data for SPI
 *   device
 *
 * Input Parameters:
 *   priv   - Device-specific state data
 *   txbuffer - The buffer of data to send to the device (may be NULL).
 *   nwords   - The total number of words to be exchanged.  If the interface
 *              uses <= 8 bits per word, then this is the number of
 *              uint8_t's; if the interface uses >8 bits per word, then this
 *              is the number of uint16_t's
 *
 * Returned Value:
 *   0: success, <0:Negated error number on failure
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_POLLWAIT
static int rspi_txinterrupt(int irq, void *context, void *arg)
{
  struct rx65n_rspidev_s *priv = rspi_mapirq(irq);

#ifdef CONFIG_RX65N_RSPI_DTC_DT_MODE
  uint8_t regval8;
#endif

  DEBUGASSERT(priv != NULL);

#ifdef CONFIG_RX65N_RSPI_SW_DT_MODE
  /* Handle outgoing Tx FIFO transfers */

  rspi_performtx(priv);

#else

  /* DTC transfer completion */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  if ((regval8 & RSPI_SPCR_TXMD) == 1)
    {
      regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
      regval8 &= ~(RSPI_SPCR_SPRIE | RSPI_SPCR_SPTIE);
      rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

      /* Yes, wake up the waiting thread */

      nxsem_post(&priv->waitsem);
    }

#endif

  return OK;
}
#endif

/****************************************************************************
 * Name: rspi_lock
 *
 * Description:
 *   On SPI buses where there are multiple devices, it will be necessary to
 *   lock SPI to have exclusive access to the buses for a sequence of
 *   transfers.  The bus should be locked before the chip is selected. After
 *   locking the SPI bus, the caller should then also call the setfrequency,
 *   setbits, and setmode methods to make sure that the SPI is properly
 *   configured for the device.  If the SPI bus is being shared, then it
 *   may have been left in an incompatible state.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock spi bus, false: unlock SPI bus
 *
 * Returned Value:
 *   0: success, <0:Negated error number on failure
 *
 ****************************************************************************/

static int rspi_lock(struct spi_dev_s *dev, bool lock)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  int ret;

  if (lock)
    {
      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: rspi_setfrequency
 *
 * Description:
 *   Set the RSPI frequency.
 *
 * Input Parameters:
 *   dev -       Device-specific state data
 *   frequency - The SPI frequency requested
 *
 * Returned Value:
 *   Returns the actual frequency selected
 *
 ****************************************************************************/

static uint32_t rspi_setfrequency(struct spi_dev_s *dev,
                                  uint32_t frequency)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  uint32_t actual;

  DEBUGASSERT(priv);
  actual = priv->actual;

  if (frequency != priv->frequency)
    {
      /* Below formula used to calculate bit rate
       * Bit rate f(PCLK)/(2 * (n + 1) * 2^N) .
       * n denotes SPBR setting (0,1,2..255) .
       * N denotes a BRDV[1:0] bit setting (0, 1, 2, 3) .
       */

      uint16_t regval16;
      uint32_t brdv;
      uint8_t spbr;

      /* N=0 as per fit code */

      brdv = RSPI_BRDV_DEFAULT;

      DEBUGASSERT(brdv < 4);

      if (frequency >= priv->rspiclock / FREQ_DIVISOR_2)
        {
          actual   = priv->rspiclock / FREQ_DIVISOR_2;
        }
      else if (frequency >= priv->rspiclock / FREQ_DIVISOR_4)
        {
          actual   = priv->rspiclock /  FREQ_DIVISOR_4;
        }
      else if (frequency >= priv->rspiclock / FREQ_DIVISOR_6)
        {
          actual   = priv->rspiclock /  FREQ_DIVISOR_6;
        }
      else if (frequency >= priv->rspiclock / FREQ_DIVISOR_8)
        {
          actual   = priv->rspiclock /  FREQ_DIVISOR_8;
        }
      else if (frequency >= priv->rspiclock / FREQ_DIVISOR_10)
        {
          actual   = priv->rspiclock /  FREQ_DIVISOR_10;
        }
      else if (frequency >= priv->rspiclock / FREQ_DIVISOR_12)
        {
          actual   = priv->rspiclock /  FREQ_DIVISOR_12;
        }
      else if (frequency >= priv->rspiclock / FREQ_DIVISOR_24)
        {
          actual   = priv->rspiclock /  FREQ_DIVISOR_24;
        }
      else if (frequency >= priv->rspiclock / FREQ_DIVISOR_48)
        {
          actual   = priv->rspiclock /  FREQ_DIVISOR_48;
        }
      else /* (frequency >= priv->rspiclock / FREQ_DIVISOR_96) */
        {
          actual   = priv->rspiclock /  FREQ_DIVISOR_96;
        }

      /* Calculate n and set the n in SPBR */

      spbr =  (priv->rspiclock / (2 * actual * ((1 << brdv)))) - 1;
      rspi_putreg8(priv, RX65N_RSPI_SPBR_OFFSET, spbr);

      /* Set the N as BRDV[1:0] in SPCMD0 b2 and b3 */

      regval16 = rspi_getreg16(priv, RX65N_RSPI_SPCMD0_OFFSET);
      regval16 &= ~(RSPI_SPCMD_BRDV_MASK);
      regval16 |= (brdv << 2);
      rspi_putreg16(priv, RX65N_RSPI_SPCMD0_OFFSET, regval16);

      /* Save the frequency and actual frequency in RSPI device structure */

      priv->frequency = frequency;
      priv->actual    = actual;
    }

  return actual;
}

/****************************************************************************
 * Name: rspi_setmode
 *
 * Description:
 *   Set the SPI mode. Optional.  See enum spi_mode_e for mode definitions
 *
 * Input Parameters:
 *   dev -  Device-specific state data
 *   mode - The SPI mode requested
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

static void rspi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;

  uint16_t regval16;

  if (priv && mode != priv->mode)
    {
      uint32_t modebits;

