apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi.c
      /* Select the CTL register bits based on the selected mode */

      switch (mode)
        {
          case SPIDEV_MODE0: /* CPOL=0 CPHA=0 */
            modebits = 0;
            break;

          case SPIDEV_MODE1: /* CPOL=0 CPHA=1 */
            modebits = RSPI_SPCMD_PHA;
            break;

          case SPIDEV_MODE2: /* CPOL=1 CPHA=0 */
            modebits = RSPI_SPCMD_POL;
            break;

          case SPIDEV_MODE3: /* CPOL=1 CPHA=1 */
            modebits = RSPI_SPCMD_PHA | RSPI_SPCMD_POL;
            break;

          default:
            spiwarn("Warning: Unsupported RSPI mode: %d\n", mode);
            return;
        }

      /* Then set the selected mode */

      regval16 = rspi_getreg16(priv, RX65N_RSPI_SPCMD0_OFFSET);
      regval16 &= ~(RSPI_SPCMD_PHA | RSPI_SPCMD_POL);
      regval16 |= modebits;
      rspi_putreg16(priv, RX65N_RSPI_SPCMD0_OFFSET, regval16);

      /* Save the mode so that subsequent re-configurations will be faster */

      priv->mode = mode;
    }
}

/****************************************************************************
 * Name: rspi_setbits
 *
 * Description:
 *   Set the number of bits per word.
 *
 * Input Parameters:
 *   dev -  Device-specific state data
 *   nbits - The number of bits requests
 *
 * Returned Value:
 *   none
 *
 ****************************************************************************/

static void rspi_setbits(struct spi_dev_s *dev, int nbits)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  uint8_t regval8;
  uint16_t regval16;

  if (priv && nbits != priv->nbits && nbits > 0 && nbits <= 16)
    {
      if (nbits >= 4 && nbits <= 8)
        {
          regval8 = rspi_getreg8(priv, RX65N_RSPI_SPDCR_OFFSET);
          regval8 |= RSPI_SPDCR_SPBYT;
          rspi_putreg8(priv, RX65N_RSPI_SPDCR_OFFSET, regval8);
        }
      else if (nbits > 8 && nbits <= 16)
        {
          regval8 = rspi_getreg8(priv, RX65N_RSPI_SPDCR_OFFSET);
          regval8 &= ~(RSPI_SPDCR_SPLW | RSPI_SPDCR_SPBYT);
          rspi_putreg8(priv, RX65N_RSPI_SPDCR_OFFSET, regval8);
        }
      else
        {
          spierr("ERROR: RSPI not supporting: %d bit word\n", nbits);
        }

      /* Configure command data register for this transfer */

      regval16 = rspi_getreg16(priv, RX65N_RSPI_SPCMD0_OFFSET);
      regval16 |= (RSPI_SPCMD_SPB_MASK & ((nbits - 1) << 8));
      rspi_putreg16(priv, RX65N_RSPI_SPCMD0_OFFSET, regval16);

      priv->nbits   = nbits;
    }
  else
    {
      spiwarn("Warning: Unsupported RSPI Word width: %d\n", nbits);
    }
}

/****************************************************************************
 * Name: rspi_send
 *
 * Description:
 *   Exchange one word on RSPI
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   wd  - The word to send.  the size of the data is determined by the
 *         number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   response
 *
 ****************************************************************************/

static uint32_t rspi_send(struct spi_dev_s *dev, uint32_t wd)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  uint32_t response = 0;

  rspi_transfer(priv, &wd, &response, 1);
  return response;
}

/****************************************************************************
 * Name: rspi_exchange
 *
 * Description:
 *   Exahange a block of data from SPI. Required.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   buffer   - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_SPI_EXCHANGE
static void rspi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                          void *rxbuffer, size_t nwords)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  rspi_transfer(priv, txbuffer, rxbuffer, nwords);
}
#endif

/****************************************************************************
 * Name: rspi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev -    Device-specific state data
 *   buffer - A pointer to the buffer of data to be sent
 *   nwords - the length of data to send from the buffer in number of words.
 *            The wordsize is determined by the number of bits-per-word
 *            selected for the SPI interface.  If nbits <= 8, the data is
 *            packed into uint8_t's; if nbits >8, the data is packed into
 *            uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void rspi_sndblock(struct spi_dev_s *dev, const void *buffer,
                          size_t nwords)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  rspi_transfer(priv, buffer, NULL, nwords);
}
#endif

/****************************************************************************
 * Name: rspi_recvblock
 *
 * Description:
 *   Revice a block of data from SPI
 *
 * Input Parameters:
 *   dev -    Device-specific state data
 *   buffer - A pointer to the buffer in which to receive data
 *   nwords - the length of data that can be received in the buffer in number
 *            of words.  The wordsize is determined by the number of
 *            bits-per-word selected for the SPI interface.  If nbits <= 8,
 *            the data is packed into uint8_t's; if nbits >8, the data is
 *            packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void rspi_recvblock(struct spi_dev_s *dev, void *buffer,
                           size_t nwords)
{
  struct rx65n_rspidev_s *priv = (struct rx65n_rspidev_s *)dev;
  rspi_transfer(priv, NULL, buffer, nwords);
}
#endif

/****************************************************************************
 * Function Name: rspi_interrupt_init
 * Description  : Configure ICU for RSPI interrupt
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

void rspi_interrupt_init(struct rx65n_rspidev_s *priv, uint8_t bus)
{
  /* Enable error interrupt source bit */

  IEN(ICU, GROUPAL0) = 0;  /* Disable Group AL0 interrupts */
  IR(ICU, GROUPAL0)  = 0;  /* Clear interrupt flag */
  IPR(ICU, GROUPAL0) = RX65N_RSPI_INTRRUPT_PRIO;
  IEN(ICU, GROUPAL0) = 1;  /* Enable Group AL0 interrupt */

#ifdef CONFIG_RX65N_RSPI0
  if (bus == RX65N_RSPI_CHANNEL0)
    {
      /* Configure Transmit empty buffer interrupt source bit */

      IEN(RSPI0, SPTI0) = 0;  /* Disable SPTI0 interrupts */
      IR(RSPI0, SPTI0)  = 0;  /* Clear interrupt flag */
      IPR(RSPI0, SPTI0) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI0, SPTI0) = 1;  /* Enable SPTI0 interrupt */
      ICU.IER[0x04].BIT.IEN7 = 1;

