apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi.c
      /* Configure Receive buffer full interrupt source bit */

      IEN(RSPI0, SPRI0) = 0; /* Disable SPRI0 interrupts */
      IR(RSPI0, SPRI0) = 0;  /* Clear interrupt flag */
      IPR(RSPI0, SPRI0) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI0, SPRI0) = 1; /* Enable SPRI0 interrupt */
      ICU.IER[0x04].BIT.IEN6 = 1;

      /* Enable error interrupt source bit */

      ICU.GENAL0.BIT.EN17 = 1;

      /* Enable Idle interrupt source bit */

      ICU.GENAL0.BIT.EN16 = 1;
    }
#endif

#ifdef CONFIG_RX65N_RSPI1
  if (bus == RX65N_RSPI_CHANNEL1)
    {
      /* Configure Transmit empty buffer interrupt */

      IEN(RSPI1, SPTI1) = 0;  /* Disable SPTI1 interrupts */
      IR(RSPI1, SPTI1)  = 0;  /* Clear interrupt flag */
      IPR(RSPI1, SPTI1) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI1, SPTI1) = 1;  /* Enable SPTI1 interrupt */
      ICU.IER[0x05].BIT.IEN1 = 1;

      /* Configure Receive buffer full interrupt */

      IEN(RSPI1, SPRI1) = 0;  /* Disable SPRI1 interrupts */
      IR(RSPI1,  SPRI1) = 0;  /* Clear interrupt flag */
      IPR(RSPI1, SPRI1) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI1, SPRI1) = 1;  /* Enable SPRI1 interrupt */
      ICU.IER[0x05].BIT.IEN0 = 1;

      /* Enable error interrupt source bit */

      ICU.GENAL0.BIT.EN19 = 1;

      /* Enable Idle interrupt source bit */

      ICU.GENAL0.BIT.EN18 = 1;
    }
#endif

#ifdef CONFIG_RX65N_RSPI2
  if (bus == RX65N_RSPI_CHANNEL2)
    {
      /* Configure Transmit empty buffer interrupt */

      IEN(RSPI2, SPTI2) = 0;  /* Disable SPTI2 interrupts */
      IR(RSPI2, SPTI2)  = 0;  /* Clear interrupt flag */
      IPR(RSPI2, SPTI2) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI2, SPTI2) = 1;  /* Enable SPTI2 interrupt */
      ICU.IER[13].BIT.IEN5 = 1;

      /* Configure Receive buffer full interrupt */

      IEN(RSPI2, SPRI2) = 0;  /* Disable SPRI2 interrupts */
      IR(RSPI2, SPRI2)  = 0;  /* Clear interrupt flag */
      IPR(RSPI2, SPRI2) = RX65N_RSPI_INTRRUPT_PRIO;
      IEN(RSPI2, SPRI2) = 1;  /* Enable SPRI2 interrupt */
      ICU.IER[13].BIT.IEN4 = 1;

      /* Enable error interrupt source bit */

      ICU.GENAL0.BIT.EN21 = 1;

      /* Enable Idle interrupt source bit */

      ICU.GENAL0.BIT.EN20 = 1;
    }
#endif
}

/****************************************************************************
 * Function Name: power_on_off
 * Description : Switches power to an RSPI channel.  Required by FIT spec.
 * Arguments :
 *   channel -Which channel to use.
 *   on_or_off -0 means 1 means off
 * Return Value : none
 ****************************************************************************/

static void rspi_power_on_off(uint8_t channel, uint8_t on_or_off)
{
  SYSTEM.PRCR.WORD = 0xa50bu;

  switch (channel)
    {
      case RX65N_RSPI_CHANNEL0:
        MSTP(RSPI0) = on_or_off;
        break;
      case RX65N_RSPI_CHANNEL1:
        MSTP(RSPI1) = on_or_off;
        break;
      case RX65N_RSPI_CHANNEL2:
        MSTP(RSPI2) = on_or_off;
        break;
    }
}

/****************************************************************************
 * Function Name: rspi_reg_protect
 * Description : Register protection enable/disable.  Required by FIT spec.
 * Arguments :
 *   enable - used to enable and disable protection
 * Return Value : none
 ****************************************************************************/

static void rspi_reg_protect(uint8_t enable)
{
  SYSTEM.PRCR.WORD = 0xa50b;
  MPC.PWPR.BIT.B0WI = 0;
  MPC.PWPR.BIT.PFSWE = 1;
}

/****************************************************************************
 * Name: rspi_bus_initialize
 *
 * Description:
 *   Initialize the selected RSPI bus in its default state (Master, 8-bit,
 *   mode 0, etc.)
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void rspi_bus_initialize(struct rx65n_rspidev_s *priv)
{
  uint8_t regval8;
  uint16_t regval16;

#if  defined(CONFIG_RX65N_RSPI_DTC_DT_MODE)
  int ret;

  /* Prepare Transmit and receive parameter */

  priv->dtchandle = rx65n_dtc_gethandle(0);
  ret = rx65n_dtc_setup_static_transferdata(priv->dtchandle,
                                         priv->txvec, (uint32_t)&tx_cfg,
                                        (uint32_t)priv->p_txdt, (uint32_t)0);
  if (ret < 0)
    {
      spierr("ERROR:[%d] Fail to configure DTC information for TX\n", ret);
      return;
    }

  ret = rx65n_dtc_setup_static_transferdata(priv->dtchandle,
                                       priv->rxvec, (uint32_t)&rx_cfg,
                                      (uint32_t)priv->p_rxdt, (uint32_t)0);
  if (ret < 0)
    {
      spierr("ERROR:[%d] Fail to configure DTC information for RX\n", ret);
      return;
    }

#endif

  /* Initialize control register */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPCR_OFFSET);
  regval8 = regval8 & (~RSPI_SPCR_SMPS); /* RSPI operation (4-wire method) */
  regval8 = regval8 & (~RSPI_SPCR_TXMD); /* Full-duplex synchronous serial communications */
  regval8 = regval8 | (RSPI_SPCR_MSTR);  /* Master mode */
  rspi_putreg8(priv, RX65N_RSPI_SPCR_OFFSET, regval8);

  /* RSPI Pin Control Register */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SPPCR_OFFSET);
  regval8 &= (~(RSPI_SPPCR_SPLP      /* Loopback mode */
               | RSPI_SPPCR_SPLP2    /* Loopback mode */
               | RSPI_SPPCR_MOIFV    /* MOSI pin idles high */
               | RSPI_SPPCR_MOIFE)); /* MOSI pin idles at MOIFV */
  rspi_putreg8(priv, RX65N_RSPI_SPPCR_OFFSET, regval8);

  /* Sets polarity of SSL signal */

  regval8 = rspi_getreg8(priv, RX65N_RSPI_SSLP_OFFSET);
  regval8 &= (~(RSPI_SSLP_SSL0P
                | RSPI_SSLP_SSL1P
                | RSPI_SSLP_SSL2P
                | RSPI_SSLP_SSL3P)); /* RSPCK is low when idle */
  rspi_putreg8(priv, RX65N_RSPI_SSLP_OFFSET, regval8);

  /* Initialize frequency, frame size and SPI mode */

  priv->frequency = 0;
  priv->mode      = SPIDEV_MODE0;

  /* Select a default frequency of approx. 400KHz */

