apache/nuttx/arch/renesas/src/rx65n/rx65n_rspi.c
      if (!priv->initialized)
        {
          /* Configure SPI1 pins 4WIRE mode: RSPCKB, MOSIB, MISOB and SSLB0 */

          rspi_reg_protect(REG_PROTECTION_OFF); /* Disable protection */
          rspi_pinconfig(bus);

          /* Switches power to an RSPI channel */

          rspi_power_on_off(bus, RSPI_POWER_ON);

          /* Configure interrupt controller for RSPI */

          rspi_interrupt_init(priv, bus);

          /* Set up default configuration: Master, 8-bit, etc. */

          rspi_bus_initialize(priv);
          priv->initialized = true;
        }
    }
  else
#endif
#ifdef CONFIG_RX65N_RSPI2
  if (bus == RX65N_RSPI_CHANNEL2)
    {
      /* Select SPI2 */

      priv = &g_rspi2dev;

      /* Only configure if the bus is not already configured */

      if (!priv->initialized)
        {
          /* Configure SPI2 pins 4WIRE mode: RSPCKC, MOSIC, MISOC and SSLC0 */

          rspi_reg_protect(REG_PROTECTION_OFF); /* Disable protection */
          rspi_pinconfig(bus);

          /* Switches power to an RSPI channel */

          rspi_power_on_off(bus, RSPI_POWER_ON);

          /* Configure interrupt controller for RSPI */

          rspi_interrupt_init(priv, bus);

          /* Set up default configuration: Master, 8-bit, etc. */

          rspi_bus_initialize(priv);

          priv->initialized = true;
        }
    }
  else
#endif
    {
      spierr("ERROR: Unsupported RSPI bus: %d\n", bus);
    }

  leave_critical_section(flags);
  return (struct spi_dev_s *)priv;
}

#endif /* CONFIG_RX65N_RSPI0 || CONFIG_RX65N_RSPI1 || CONFIG_RX65N_RSPI2 */
